package com.epam.upskill;

//8. Создать класс Customer, спецификация которого приведена ниже. Определить конструкторы, set- и get- методы и
// метод  toString(). Создать второй класс, агрегирующий массив типа Customer, с подходящими конструкторами и методами.
// Задать критерии выбора данных и вывести эти данные на консоль.
//Класс Customer: id, фамилия, имя, отчество, адрес, номер кредитной карточки, номер банковского счета.
//Найти и вывести:
//a) список покупателей в алфавитном порядке;
//b) список покупателей, у которых номер кредитной карточки находится в заданном интервале

public class Main {
    public static void main(String[] args) {
        CustomerArray customerArray = new CustomerArray(10);

        customerArray.addCustomer(new Customer(1, "Муравьёв", "Богдан", "Олегович", "Минск", 5404363509655166L, 4791927490903266L));
        customerArray.addCustomer(new Customer(5, "Беляков", "Владлен", "Павлович", "Могилев", 5897049554011736L, 5369903883763475L));
        customerArray.addCustomer(new Customer(3, "Виноградов", "Эрик", "Рудольфович", "Брест", 59086876774149281L, 5221220904984867L));
        customerArray.addCustomer(new Customer(8, "Федосеева", "Алика", "Вадимовна", "Гродно", 5404364248303282L, 5520716067829912L));
        customerArray.addCustomer(new Customer(2, "Горбунова", "Лана", "Владиславовна", "Витебск", 5404366408935654L, 5221228947132154L));
        customerArray.addCustomer(new Customer(7, "Носков", "Леонард", "Эдуардович", "Гомель", 4743842725095078L, 5127172683971125L));
        customerArray.addCustomer(new Customer(6, "Осипова", "Зарина", "Георгиевна", "Осиповичи", 4335408659896867L, 5314508041739261L));
        customerArray.addCustomer(new Customer(4, "Тихонов", "Тимур", "Сергеевич", "Орша", 4375393992213506L, 5221228430121029L));
        customerArray.addCustomer(new Customer(9, "Ильина", "Виктория", "Алекеевна", "Жодино", 5908687677414928L, 5592096871847043L));
        customerArray.addCustomer(new Customer(10, "Басаримова", "Ирина", "Петровна", "Логойск", 5324203486060740L, 5177431707425677L));
        customerArray.condition();
    }
}
